app/views/users/show.html.erb

              <div class="flex justify-end gap-x-2">
                <p class="text-sm font-bold text-slate-200">Likes: <%= post.likes.count %></p>
                <p class="text-sm font-bold text-slate-200">Comments: <%= post.comments.count %></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]