app/views/posts/index.html.erb

            <div class="flex justify-end gap-x-2">
              <p class="text-sm font-bold text-slate-200">Likes: <%= post.likes.count %></p>
              <p class="text-sm font-bold text-slate-200">Comments: <%= post.comments.count %></p>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]


        <% if post.comments.count > 0 %>
          <div class="border border-slate-100 rounded p-1 w-full flex flex-col gap-y-1">
            <% post.order_post_comments.each do |comment| %>
              <% user = User.find(comment.user_id) %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]