app/views/posts/index.html.erb


  <% post.order_post_comments.each do |comment| %>
---
SELECT "posts".* FROM "posts"