app/views/posts/show.html.erb

          <li class="font-semibold text-sm text-slate-200">
            Comments: <%= @post.comments.count %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

          <li class="font-semibold text-sm text-slate-200">
            Likes: <%= @post.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]

    <div class="border border-slate-200 rounded p-2 flex flex-col gap-y-1">
      <% if @post.comments.count > 0 %>
        <% @post.comments.each do |comment| %>
          <% user = User.find(comment.user_id) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]