app/controllers/comments_controller.rb

  def new
    @current_user = User.find(params[:user_id])
    @post = Post.find(params[:post_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @user = User.find(params[:user_id])
    @post = Post.find(params[:post_id])
    @current_user = current_user
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 19], ["post_id", 27], ["text", "felipe test comment2"], ["created_at", "2023-11-17 14:55:04.033703"], ["updated_at", "2023-11-17 14:55:04.033703"]]

  def destroy
    @comment = Comment.find(params[:id])
    @post = @comment.post
    @user = @comment.user
    @post_user = User.find(params[:user_id])

    return unless @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 18]]