app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["post_id", 1], ["created_at", "2023-11-10 19:50:43.621903"], ["updated_at", "2023-11-10 19:50:43.621903"]]
---
  def create
    @current_user = current_user
    @post = Post.find(params[:post_id])
    @like = Like.create!(user: @current_user, post: @post)