app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @posts = @user.posts.paginate(page: params[:page], per_page: 4).includes(:comments, :likes)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def show
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = current_user
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("author_id", "title", "text", "likes_counter", "comments_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["author_id", 3], ["title", "new"], ["text", "post"], ["likes_counter", 0], ["comments_counter", 0], ["created_at", "2023-11-10 18:15:17.406495"], ["updated_at", "2023-11-10 18:15:17.406495"]]

  def destroy
    @post = Post.find(params[:id])
    @user = current_user

    return unless @post.destroy

    @user.decrement!(:post_counter)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 11]]
UPDATE "users" SET "post_counter" = COALESCE("post_counter", 0) - $1 WHERE "users"."id" = $2  [["post_counter", 1], ["id", 18]]