app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def create
    @user = User.find(params[:user_id])