app/models/comment.rb

  def comments_counter
    post.update(comments_counter: post.comments.count)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-11-10 19:27:56.153133"], ["id", 2]]