app/models/like.rb

  def likes_counter
    post.update(likes_counter: post.likes.count)
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-11-10 19:50:43.632998"], ["id", 1]]