app/models/post.rb

  def order_post_comments
    comments.order(created_at: :desc).limit(5)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def post_counter
    author.update(post_counter: author.posts.count)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 3]]